<!DOCTYPE html>
<html lang=en>
<head>
    <!-- so meta -->
    <meta charset="utf-8">
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <meta name="HandheldFriendly" content="True">
    <meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=5" />
    <meta name="description" content="ret2dlresovle攻击原理ret2dlresovle攻击的本质就是在于程序在动态链接时篡改相关结构体，让程序解析到错误的函数，进而达成攻击 Lazy Binding当程序在第一次调用某个函数时，会调用_dl_runtime_resolve函数从libc中获取这个函数的真实地址 那么具体是怎么实现的呢？ 动态链接的程序调用函数时会先call一个函数的plt表，如read@plt，执行read">
<meta property="og:type" content="article">
<meta property="og:title" content="ret2dlresolve超详解">
<meta property="og:url" content="http://example.com/2025/04/29/ret2dlresolve%E8%B6%85%E8%AF%A6%E8%A7%A3/index/index.html">
<meta property="og:site_name" content="PuH4ck3rX&#39;s Blog">
<meta property="og:description" content="ret2dlresovle攻击原理ret2dlresovle攻击的本质就是在于程序在动态链接时篡改相关结构体，让程序解析到错误的函数，进而达成攻击 Lazy Binding当程序在第一次调用某个函数时，会调用_dl_runtime_resolve函数从libc中获取这个函数的真实地址 那么具体是怎么实现的呢？ 动态链接的程序调用函数时会先call一个函数的plt表，如read@plt，执行read">
<meta property="og:locale" content="en_US">
<meta property="og:image" content="http://example.com/2025/04/29/ret2dlresolve%E8%B6%85%E8%AF%A6%E8%A7%A3/index/Snipaste_2025-03-04_18-24-55-1745939812038-1.png">
<meta property="og:image" content="http://example.com/2025/04/29/ret2dlresolve%E8%B6%85%E8%AF%A6%E8%A7%A3/index/Snipaste_2025-03-04_18-24-55-1741084407261-2-1745939812039-3.png">

<figure class="highlight c"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br></pre></td><td class="code"><pre><span class="line">┌─┬──────────────────────────────────────────────────────────────────────────────────┐</span><br><span class="line">│<span class="number">1</span>│<span class="comment">/* How to extract and insert information held in the st_other field.  */</span>          │</span><br><span class="line">│<span class="number">2</span>│<span class="meta">#<span class="keyword">define</span> ELF32_ST_VISIBILITY(o)        ((o) &amp; 0x03)                                │</span></span><br><span class="line">│<span class="number">3</span>│<span class="comment">/* For ELF64 the definitions are the same.  */</span>                                    │</span><br><span class="line">│<span class="number">4</span>│<span class="meta">#<span class="keyword">define</span> ELF64_ST_VISIBILITY(o)        ELF32_ST_VISIBILITY (o)                     │</span></span><br><span class="line">│<span class="number">5</span>│<span class="comment">/* Symbol visibility specification encoded in the st_other field.  */</span>             │</span><br><span class="line">│<span class="number">6</span>│<span class="meta">#<span class="keyword">define</span> STV_DEFAULT        0                <span class="comment">/* Default symbol visibility rules */</span> │</span></span><br><span class="line">│<span class="number">7</span>│<span class="meta">#<span class="keyword">define</span> STV_INTERNAL       1                <span class="comment">/* Processor specific hidden class */</span> │</span></span><br><span class="line">│<span class="number">8</span>│<span class="meta">#<span class="keyword">define</span> STV_HIDDEN         2                <span class="comment">/* Sym unavailable in other modules */</span>│</span></span><br><span class="line">│<span class="number">9</span>│<span class="meta">#<span class="keyword">define</span> STV_PROTECTED      3                <span class="comment">/* Not preemptible, not exported */</span>   │</span></span><br><span class="line">└─┴──────────────────────────────────────────────────────────────────────────────────┘</span><br></pre></td></tr></table></figure>

<p>这两个分支的区别无非在于当前查询的符号知否是已知的</p>
<ol>
<li>若不是已知的则找到待解析函数所在文件的<code>link_map</code>，然后取出<code>l_addr</code>再计算.</li>
<li>若是已知的则直接拿<code>l</code>的<code>l_addr</code>进行计算。</li>
</ol>
<p>进入else分支之后，我们地址的计算方式变更为<code>value = l-&gt;l_addr + sym-&gt;st_value</code>。</p>
<p>那么因为原来<code>libc</code>中的<code>link_map</code>地址未知，则该<code>link_map</code>的<code>l_addr</code>值我们没有办法改变，那么如果我们能“另起炉灶”，构造一个新的的<code>link_map</code>呢？</p>
<p>我们构造的<code>link_map</code>要使得其：</p>
<figure class="highlight python"><table><tr><td class="gutter"><pre><span class="line">1</span><br></pre></td><td class="code"><pre><span class="line">l_addr = RVA(func A) - RVA(func B)</span><br></pre></td></tr></table></figure>

<p>其中<code>func A</code>为我们想要解析的函数，如<code>system</code>，<code>execve</code>,<code>func B</code>为当前程序已经解析的函数，如<code>__libc_start_main</code>。</p>
<figure class="highlight c"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br><span class="line">17</span><br><span class="line">18</span><br><span class="line">19</span><br><span class="line">20</span><br><span class="line">21</span><br></pre></td><td class="code"><pre><span class="line">type = <span class="keyword">struct</span> &#123;</span><br><span class="line"><span class="comment">/*    0      |     4 */</span>    Elf32_Word st_name;</span><br><span class="line"><span class="comment">/*    4      |     4 */</span>    Elf32_Addr st_value;</span><br><span class="line"><span class="comment">/*    8      |     4 */</span>    Elf32_Word st_size;</span><br><span class="line"><span class="comment">/*   12      |     1 */</span>    <span class="type">unsigned</span> <span class="type">char</span> st_info;</span><br><span class="line"><span class="comment">/*   13      |     1 */</span>    <span class="type">unsigned</span> <span class="type">char</span> st_other;</span><br><span class="line"><span class="comment">/*   14      |     2 */</span>    Elf32_Section st_shndx;</span><br><span class="line"></span><br><span class="line">                           <span class="comment">/* total size (bytes):   16 */</span></span><br><span class="line">&#125;Elf32_Sym;</span><br><span class="line"></span><br><span class="line"><span class="class"><span class="keyword">struct</span>&#123;</span></span><br><span class="line"><span class="comment">/*    0      |     4 */</span>    Elf64_Word st_name;</span><br><span class="line"><span class="comment">/*    4      |     1 */</span>    <span class="type">unsigned</span> <span class="type">char</span> st_info;</span><br><span class="line"><span class="comment">/*    5      |     1 */</span>    <span class="type">unsigned</span> <span class="type">char</span> st_other;</span><br><span class="line"><span class="comment">/*    6      |     2 */</span>    Elf64_Section st_shndx;</span><br><span class="line"><span class="comment">/*    8      |     8 */</span>    Elf64_Addr st_value;</span><br><span class="line"><span class="comment">/*   16      |     8 */</span>    Elf64_Xword st_size;</span><br><span class="line"></span><br><span class="line">                           <span class="comment">/* total size (bytes):   24 */</span></span><br><span class="line">&#125;Elf64_Sym;</span><br></pre></td></tr></table></figure>

<p>然后我们再在在<code>got表</code>附近“构造”的<code>Elf_Sym</code>结构体，准确地说是恰好让结构体中的<code>st_value</code>的区域和<code>func B</code>的<code>got表项</code>重合，即借用<code>GOT表项</code>，那么此时(假设为64位)的<code>Elf_Sym</code>中的<code>st_name</code>和<code>st_other</code>字段将与<code>func B</code>的上一个GOT表项重合。</p>
<p>构造示意图如下：</p>
<p><img src="/2025/04/29/ret2dlresolve%E8%B6%85%E8%AF%A6%E8%A7%A3/index/ret2dlresolve--4.Partial-RELRO.No-Leak.png" alt="ret2dlresolve--4.Partial-RELRO.No-Leak"></p>
<p><strong>那么我们为什么要这么构造呢？</strong></p>
<p>此时解析出来的<code>value</code>则为：</p>
